l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc17xx_usart.c
        /* Start transmission of the next character. */
        USARTn->THR = *cp;

        /* Decrement the number of available bytes in the buffer. */
        rbf->rbf_cnt--;

        /* Wrap around the buffer pointer if we reached its end. */
        if (++cp == rbf->rbf_last) {
            cp = rbf->rbf_start;
        }
        rbf->rbf_tail = cp;

        /* Send an event if we reached the low watermark. */
        if (rbf->rbf_cnt == rbf->rbf_lwm) {
            NutEventPostFromIrq(&rbf->rbf_que);
            NutSelectWakeupFromIrq(rbf->wq_list, WQ_FLAG_WRITE);
        }
    }

    if ( rbf->rbf_cnt==0) {
        /* Nothing left to transmit: Disable transmit interrupts. */
        CM3BBCLR(USARTnBase, LPC_UART_TypeDef, IER, UART_IER_THREINT_EN_POS);
        NutEventPostFromIrq(&rbf->rbf_que);
        NutSelectWakeupFromIrq(rbf->wq_list, WQ_FLAG_WRITE);
    }
}


/*
 * \brief USARTn receiver ready interrupt handler.
 *
 *
 * \param rbf Pointer to the receiver ring buffer.
 */
static void Lpc17xxUsartRxReady(RINGBUF * rbf, uint32_t lsr)
{
    register size_t cnt;
    register uint8_t ch;

#ifdef UART_DMA_RXCHANNEL
    // TODO: Implement DMA support
#endif

    while (lsr & UART_LSR_RDR) {

        /*
         * We read the received character as early as possible to avoid overflows
         * caused by interrupt latency.
         */

        ch = USARTn->RBR & UART_RBR_MASK;

        /* Collect receiver errors. */
        rx_errors |= lsr & (UART_LSR_OE | UART_LSR_PE | UART_LSR_FE | UART_LSR_BI);

#if defined(UART_XONXOFF_CONTROL)
        /*
         * Handle software handshake. We have to do this before checking the
         * buffer, because flow control must work in write-only mode, where
         * there is no receive buffer.
         */
        if (flow_control) {
            /* XOFF character disables transmit interrupts. */
            if (ch == ASCII_XOFF) {
                /* Disable transmitter and transmitter interrupt */
                USARTn->TER = 0;

                CM3BBCLR(USARTnBase, LPC_UART_TypeDef, IER, UART_IER_THREINT_EN_POS);

                flow_control |= XOFF_RCVD;
                return;
            }
            /* XON enables transmit interrupts. */
            else if (ch == ASCII_XON) {
                /* Disable transmitter and transmitter interrupt */
                USARTn->TER = UART_TER_TXEN;
                CM3BBSET(USARTnBase, LPC_UART_TypeDef, IER, UART_IER_THREINT_EN_POS);

                flow_control &= ~XOFF_RCVD;
                return;
            }
        }
#endif

        /*
         * Check buffer overflow.
         */
        cnt = rbf->rbf_cnt;
        if (cnt >= rbf->rbf_siz) {
            // TODO: We use the same flag like when we got a FIFO overrun error
            rx_errors |= UART_LSR_OE;
            return;
        }

        /* Wake up waiting threads if this is the first byte in the buffer. */
        if (cnt++ == 0) {
            NutEventPostFromIrq(&rbf->rbf_que);
            NutSelectWakeupFromIrq(rbf->wq_list, WQ_FLAG_READ);
        }

#if defined(UART_XONXOFF_CONTROL)
        /*
         * Check the high watermark for software handshake. If the number of
         * buffered bytes is equal or above this mark, then send XOFF.
         */
        else if (flow_control) {
            if(cnt >= rbf->rbf_hwm) {
                if((flow_control & XOFF_SENT) == 0) {
                    /* Check it TX on and space in the FIFO, then send xoff */
                    if ((CM3BBGET(USARTnBase, LPC_UART_TypeDef, IER, UART_IER_THREINT_EN_POS)) &&
                        (lsr & UART_LSR_THRE)) {
                        USARTn->THR = ASCII_XOFF;
                        flow_control |= XOFF_SENT;
                        flow_control &= ~XOFF_PENDING;
                    } else {
                        flow_control |= XOFF_PENDING;
                    }
                }
            }
        }
#endif

#ifdef US_MODE_HWHANDSHAKE
        /*
         * Check the high watermark for hardware handshake. If the number of
         * buffered bytes is above this mark, then disable RTS.
         */
        else if (rts_control && cnt >= rbf->rbf_hwm) {
    // TODO: Disable RTS
    //        USARTn->CR3 |= USART_CR3_RTSE;
        }
#endif

        /*
         * Store the character and increment and the ring buffer pointer.
         */
        *rbf->rbf_head++ = ch;
        if (rbf->rbf_head == rbf->rbf_last) {
            rbf->rbf_head = rbf->rbf_start;
        }

        /* Update the ring buffer counter. */
        rbf->rbf_cnt = cnt;

        /* update the LSR shadow variable */
        lsr = USARTn->LSR;
    }
}

/*!
 * \brief USART interrupt handler.
 *
 * \param arg Pointer to the device specific control block.
 */
static void Lpc17xxUsartInterrupt(void *arg)
{
    USARTDCB *dcb = (USARTDCB *) arg;

    /* Read line status and interrupt identification register */
    uint32_t iir   = USARTn->IIR & UART_IIR_INTID_MASK;
    uint32_t intid = iir & UART_IIR_INTID_MASK;
    uint32_t lsr   = USARTn->LSR;

    if (intid == UART_IIR_INTID_RLS) {
        // TODO: Implement Line Status
        //        Lpc17xxUsartRxLineStatus(&dcb->dcb_rx_rbf);
    } else
    /* Test for byte received or character timeout */
    if ((intid == UART_IIR_INTID_RDA) || (intid == UART_IIR_INTID_CTI)) {
        Lpc17xxUsartRxReady(&dcb->dcb_rx_rbf, lsr);
    } else
    /* Test for next byte can be transmitted (transmit holding is empty) */
    if (intid == UART_IIR_INTID_THRE) {
        Lpc17xxUsartTxReady(&dcb->dcb_tx_rbf, lsr);
    }
}

/*!
 * \brief Carefully enable USART hardware functions.
 *
 * Always enabale transmitter and receiver, even on read-only or
 * write-only mode. So we can support software flow control.
 */
static void Lpc17xxUsartEnable(void)
{

    /* Enable UART transmitter. The receiver can not be enabled seperately on
       the LPC architecture. We just could disable the RX FIFOs, is this a
       good idea?
     */

    USARTn->TER = UART_TER_TXEN;

    /* Enable Usart Interrupts */
    NutUartIrqEnable(&SigUSART);
}

/*!
 * \brief Carefully disable USART hardware functions.
 *
 * TODO: Beschreibung anpassen
 * This routine is called before changing cruical settings like
 * baudrate, frame format etc.
 *
 * The previous version uses a 10ms delay to make sure, that any
 * incoming or outgoing character is processed. However, this time
 * depends on the baudrate.
 *
 * In fact we do not need to take care of incoming characters,
 * when changing such settings.
 *
 * For outgoing characters however, settings may be changed on
 * the fly and we should wait, until the last character transmitted
 * with the old settings has left the shift register. While TXRDY
 * is set when the holding register is empty, TXEMPTY is set when the
 * shift register is empty. The bad news is, that both are zero, if
 * the transmitter is disabled. We are not able to determine this
 * state. So we check TXRDY first and, if set, wait for any character
 * currently in the shift register.
 */
static void Lpc17xxUsartDisable(void)
{
    /* Disable Usart Interrupts*/
    NutUartIrqDisable(&SigUSART);

    /* If the transmitter is enabled, wait until all bits had been shifted out. */
    if (USARTn->TER & UART_TER_TXEN) {
        while ((USARTn->LSR & UART_LSR_TEMT) == 0);
    }

