l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc17xx_usart.c
    /* Disable Transmitter, receiver can not be disabled on the LPC
       architecture. We just could disable the RX FIFOs, is this a good idea?
     */
    USARTn->TER = 0;
}

/*!
 * \brief Query the USART hardware for the selected speed.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \return The currently selected baudrate.
 */
static uint32_t Lpc17xxUsartGetSpeed(void)
{
    uint32_t clk = 0;
    // TODO: Implement!
    return clk;
}

/*!
 * \brief Set the USART hardware bit rate.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \param rate Number of bits per second.
 *
 * \return 0 on success, -1 otherwise.
 */

static int Lpc17xxUsartSetSpeed(uint32_t baudrate)
{
    uint32_t uart_clock;
    uint32_t calcBaudrate = 0;
    uint32_t temp = 0;

    uint32_t mulFracDiv, dividerAddFracDiv;
    uint32_t diviser = 0 ;
    uint32_t bestm = 1;
    uint32_t bestd = 0;
    uint32_t best_divisor = 0;

    uint32_t relativeError = 0;
    uint32_t best_error = 100000;

    /* get UART block clock */

    uart_clock = NutArchClockGet(NUT_HWCLK_PCLK);

#if defined(MCU_LPC176x)

    if ((LPC_UART_TypeDef*)USARTn == LPC_UART0) {
        uart_clock /= Lpc176x_PclkDivGet(CLKPWR_PCLKSEL_UART0);
    } else
    if ((LPC_UART1_TypeDef*)USARTn == LPC_UART1) {
        uart_clock /= Lpc176x_PclkDivGet(CLKPWR_PCLKSEL_UART1);
    } else
    if ((LPC_UART_TypeDef*)USARTn == LPC_UART2) {
        uart_clock /= Lpc176x_PclkDivGet(CLKPWR_PCLKSEL_UART2);
    } else
    if ((LPC_UART_TypeDef*)USARTn == LPC_UART3) {
        uart_clock /= Lpc176x_PclkDivGet(CLKPWR_PCLKSEL_UART3);
    }

#endif

    uart_clock = uart_clock >> 4; /* div by 16 */

    /* Baudrate calculation is done according the following formula:
       BaudRate= uart_clock * (mulFracDiv/(mulFracDiv+dividerAddFracDiv) / (16 * (DLL)

       To avoid floating point calculation the formulae is adjusted with the
       multiply and divide method.

       The value of mulFracDiv and dividerAddFracDiv should comply to the following expressions:
       0 < mulFracDiv <= 15, 0 <= dividerAddFracDiv <= 15
    */

    for (mulFracDiv = 1 ; mulFracDiv <= 15 ;mulFracDiv++)
    {
        for (dividerAddFracDiv = 0 ; dividerAddFracDiv <= 15 ;dividerAddFracDiv++)
        {
            temp = (mulFracDiv * uart_clock) / ((mulFracDiv + dividerAddFracDiv));

            diviser = temp / baudrate;
            if ((temp % baudrate) > (baudrate / 2))
                diviser++;

            if (diviser > 2 && diviser < 65536)
            {
                calcBaudrate = temp / diviser;

                if (calcBaudrate <= baudrate) {
                    relativeError = baudrate - calcBaudrate;
                } else {
                    relativeError = calcBaudrate - baudrate;
                }

                if ((relativeError < best_error))
                {
                    bestm = mulFracDiv ;
                    bestd = dividerAddFracDiv;
                    best_divisor = diviser;
                    best_error = relativeError;
                    if (relativeError == 0) {
                        break;
                    }
                }
            }
        }
        if (relativeError == 0) {
            break;
        }
    }

    Lpc17xxUsartDisable();

    if (best_error < ((baudrate * UART_ACCEPTED_BAUDRATE_ERROR) / 100)) {
        /* Set DLAB bit */
        CM3BBSET(USARTnBase, LPC_UART_TypeDef, LCR, UART_LCR_DLAB_EN_POS);

        USARTn->DLM  = UART_LOAD_DLM(best_divisor);
        USARTn->DLL  = UART_LOAD_DLL(best_divisor);

        /* Reset DLAB bit */
        CM3BBCLR(USARTnBase, LPC_UART_TypeDef, LCR, UART_LCR_DLAB_EN_POS);
        USARTn->FDR  = (UART_FDR_MULVAL(bestm) | UART_FDR_DIVADDVAL(bestd)) & UART_FDR_BITMASK;
    } else {
        return -1;
    }

    Lpc17xxUsartEnable();

    return 0;
}

/*!
 * \brief Query the USART hardware for the number of data bits.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \return The number of data bits set.
 */
static uint8_t Lpc17xxUsartGetDataBits(void)
{
    uint32_t lcr = USARTn->LCR;

    switch(lcr & UART_LCR_WLEN_BITMASK) {
        case UART_LCR_WLEN5: return 5;
        case UART_LCR_WLEN6: return 6;
        case UART_LCR_WLEN7: return 7;
        case UART_LCR_WLEN8: return 8;
    }

    return 0;
}

/*!
 * \brief Set the USART hardware to the number of data bits.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartSetDataBits(uint8_t bits)
{
    int rc = 0;
    uint32_t lcr;

    Lpc17xxUsartDisable();

    lcr = USARTn->LCR & ~UART_LCR_WLEN_BITMASK;
    switch (bits)
    {
        case 5:
            lcr |= UART_LCR_WLEN5;
            break;

        case 6:
            lcr |= UART_LCR_WLEN6;
            break;

        case 7:
            lcr |= UART_LCR_WLEN7;
            break;

        case 8:
            lcr |= UART_LCR_WLEN8;
            break;

        default:
            Lpc17xxUsartEnable();
            return -1;
    }
    USARTn->LCR = lcr & UART_LCR_BITMASK;

    Lpc17xxUsartEnable();

    return rc;
}

/*!
 * \brief Query the USART hardware for the parity mode.
 *
 * This routine is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \return Parity mode, either 0 (disabled), 1 (odd), 2 (even), 3 (mark) or 4 (space)
 */
static uint8_t Lpc17xxUsartGetParity(void)
{
    uint32_t lcr = USARTn->LCR;

    switch(lcr & UART_LCR_PARITY_BITMASK) {
        case UART_LCR_PARITY_EN | UART_LCR_PARITY_ODD:  return 1;
        case UART_LCR_PARITY_EN | UART_LCR_PARITY_EVEN: return 2;
        case UART_LCR_PARITY_EN | UART_LCR_PARITY_F_1:  return 3;
        case UART_LCR_PARITY_EN | UART_LCR_PARITY_F_0:  return 4;
        default:
            return 0;
    }

