l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc17xx_usart.c
    return 0;
}

/*!
 * \brief Set the USART hardware to the specified parity mode.
 *
 * This routine is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \param mode 0 (disabled), 1 (odd), 2 (even) 3 (mark) or 4(space)
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartSetParity(uint8_t mode)
{
    uint32_t lcr;

    Lpc17xxUsartDisable();

    lcr = USARTn->LCR & ~UART_LCR_PARITY_BITMASK;

    switch (mode) {
        case 0:
            /* Parity disabled, do nothing */
            break;
        case 1:
            lcr |= UART_LCR_PARITY_EN | UART_LCR_PARITY_ODD;
            break;
        case 2:
            lcr |= UART_LCR_PARITY_EN | UART_LCR_PARITY_EVEN;
            break;
        case 3:
            lcr |= UART_LCR_PARITY_EN | UART_LCR_PARITY_F_1;
            break;
        case 4:
            lcr |= UART_LCR_PARITY_EN | UART_LCR_PARITY_F_0;
            break;
        default:
            Lpc17xxUsartEnable();
            return -1;
    }

    USARTn->LCR = lcr & UART_LCR_BITMASK;

    Lpc17xxUsartEnable();

    return 0;
}

/*!
 * \brief Query the USART hardware for the number of stop bits.
 *
 * This routine is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \return The number of stop bits set, either 1, 2 or 3 (1.5 bits).
 */
static uint8_t Lpc17xxUsartGetStopBits(void)
{
    uint32_t lcr = USARTn->LCR;

    if (lcr & UART_LCR_STOPBIT_SEL) {
        if ((lcr & UART_LCR_WLEN_BITMASK) == UART_LCR_WLEN5) {
            return 3;
        } else {
            return 2;
        }
    } else {
        return 1;
    }
}

/*!
 * \brief Set the USART hardware to the number of stop bits.
 *
 * This routine is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \param bits The number of stop bits set, either 1, 2 or 3 (1.5 bits).
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartSetStopBits(uint8_t bits)
{
    Lpc17xxUsartDisable();

    switch (bits) {
        case 1:
            CM3BBCLR(USARTnBase, LPC_UART_TypeDef, LCR, UART_LCR_STOPBIT_SEL_POS);
            break;
        case 2:
            CM3BBSET(USARTnBase, LPC_UART_TypeDef, LCR, UART_LCR_STOPBIT_SEL_POS);
            break;
        case 3:
            if ((USARTn->LCR & UART_LCR_WLEN_BITMASK) == UART_LCR_WLEN5) {
                CM3BBSET(USARTnBase, LPC_UART_TypeDef, LCR, UART_LCR_STOPBIT_SEL_POS);
            } else {
                Lpc17xxUsartEnable();
                return -1;
            }
            break;
        default:
            Lpc17xxUsartEnable();
            return -1;
    }

    Lpc17xxUsartEnable();

    return 0;
}

/*!
 * \brief Query the USART hardware status.
 *
 * \return Status flags.
 */
static uint32_t Lpc17xxUsartGetStatus(void)
{
    uint32_t rc = 0;

    /*
     * Set receiver error and status flags.
     */
    if ((rx_errors & UART_LSR_FE) != 0) {
        rc |= UART_FRAMINGERROR;
    }
    if ((rx_errors & UART_LSR_OE) != 0) {
        rc |= UART_OVERRUNERROR;
    }
    if ((rx_errors & UART_LSR_PE) != 0) {
        rc |= UART_PARITYERROR;
    }
    if ((rx_errors & UART_LSR_BI) != 0) {
        rc |= UART_BREAKCONDITION;
    }

#if defined(UART_XONXOFF_CONTROL)
    /*
     * Determine software handshake status. The flow control status may
     * change during interrupt, but this doesn't really hurt us.
     */
    if (flow_control) {
        if (flow_control & XOFF_SENT) {
            rc |= UART_RXDISABLED;
        }
        if (flow_control & XOFF_RCVD) {
            rc |= UART_TXDISABLED;
        }
    }
#endif

    /*
     * Determine hardware handshake control status.
     */
#if defined(US_MODE_HWHANDSHAKE)
    // TODO: reflect RTS state
#endif

    /*
     * Determine hardware handshake sense status.
     */
#if defined(US_MODE_HWHANDSHAKE)
    // TODO: reflect CTS state
#endif

    /*
     * If transmitter and receiver haven't been detected disabled by any
     * of the checks above, then they are probably enabled.
     */
    if ((rc & UART_RXDISABLED) == 0) {
        rc |= UART_RXENABLED;
    }
    if ((rc & UART_TXDISABLED) == 0) {
        rc |= UART_TXENABLED;
    }

    return rc;
}

/*!
 * \brief Set the USART hardware status.
 *
 * \param flags Status flags.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartSetStatus(uint32_t flags)
{
    int rc = 0;
    /*
     * Process software handshake control.
     */

#if defined(UART_XONXOFF_CONTROL)
    if (flow_control) {

        /* Access to the flow control status must be atomic. */
        NutUartIrqDisable(&SigUSART);

        /*
         * Enabling or disabling the receiver means to behave like
         * having sent a XON or XOFF character resp.
         */
        if (flags & UART_RXENABLED) {
            flow_control &= ~XOFF_SENT;
        } else if (flags & UART_RXDISABLED) {
            flow_control |= XOFF_SENT;
        }

        /*
         * Enabling or disabling the transmitter means to behave like
         * having received a XON or XOFF character resp.
         */
        if (flags & UART_TXENABLED) {
            flow_control &= ~XOFF_RCVD;
        } else if (flags & UART_TXDISABLED) {
            flow_control |= XOFF_RCVD;
        }
        NutUartIrqEnable(&SigUSART);
    }
#endif

    /*
     * Clear USART receive errors.
     */
    if (flags & UART_ERRORS) {
        /* Clear errors by reading the line status register */
        (volatile uint32_t)USARTn->LSR;
        rx_errors = 0;
    }

    /*
     * Verify the result.
     */
    if ((Lpc17xxUsartGetStatus() & ~UART_ERRORS) != flags) rc = -1;

    return rc;
}

/*!
 * \brief Query the USART hardware for synchronous mode.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * Not implemented for the LPC17xx USART. Always returns 0.
 *
 * \return Or-ed combination of \ref UART_SYNC, \ref UART_MASTER,
 *         \ref UART_NCLOCK and \ref UART_HIGHSPEED.
 */
uint8_t Lpc17xxUsartGetClockMode(void)
{
    return 0;
}

/*!
 * \brief Set asynchronous or synchronous mode.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * Not implemented for the LPC17xx USART. Always returns -1.
 *
 * \param mode Must be an or-ed combination of USART_SYNC, USART_MASTER,
 *             USART_NCLOCK and USART_HIGHSPEED.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartSetClockMode(uint8_t mode)
{
    return -1;
}

/*!
 * \brief Query flow control mode.
 *
 * This routine is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \return See UsartIOCtl().
 */
static uint32_t Lpc17xxUsartGetFlowControl(void)
{
    uint32_t rc = 0;
// TODO: Implement more flow control
#if defined(UART_XONXOFF_CONTROL)
    if (flow_control) {
        rc |= USART_MF_XONXOFF;
    } else {
        rc &= ~USART_MF_XONXOFF;
    }
#endif

