l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc17xx_usart.c
#ifdef UART_DMA_RXCHANNEL
    if (block_control & BC_RD_EN)
        rc |= USART_MF_BLOCKREAD;
    else
        rc &= ~USART_MF_BLOCKREAD;
#endif

#ifdef UART_DMA_TXCHANNEL
    if (block_control & BC_WR_EN)
        rc |= USART_MF_BLOCKWRITE;
    else
        rc &= ~USART_MF_BLOCKWRITE;
#endif

    return rc;
}

/*!
 * \brief Set flow control mode.
 *
 * This function is called by ioctl function of the upper level USART
 * driver through the USARTDCB jump table.
 *
 * \param flags See UsartIOCtl().
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartSetFlowControl(uint32_t flags)
{
// TODO: Implement more flow control
#if defined(UART_XONXOFF_CONTROL)
    NutUartIrqDisable(&SigUSART);
    /*
     * Set software handshake mode.
     */
    if (flags & USART_MF_XONXOFF) {
        if(flow_control == 0) {
            flow_control = 1 | XOFF_SENT;  /* force XON to be sent on next read */
        }
    } else {
        flow_control = 0;
    }
    NutUartIrqEnable(&SigUSART);
#endif

#ifdef UART_DMA_RXCHANNEL
    /* Setup block mode */
    if( flags & USART_MF_BLOCKREAD) {
        block_control |= BC_RD_EN;
    }
    else {
        block_control &= ~BC_RD_EN;
    }
#endif

#ifdef UART_DMA_TXCHANNEL
    if( flags & USART_MF_BLOCKWRITE) {
        block_control |= BC_WR_EN;
    }
    else {
        block_control &= ~BC_WR_EN;
    }
#endif

    return 0;
}

/*!
 * \brief Start the USART transmitter hardware.
 *
 * The upper level USART driver will call this function through the
 * USARTDCB jump table each time it added one or more bytes to the
 * transmit buffer.
 */
static void Lpc17xxUsartTxStart(void)
{
    register uint8_t *cp;
    /* Enable transmit interrupts. */
    CM3BBSET(USARTnBase, LPC_UART_TypeDef, IER, UART_IER_THREINT_EN_POS);
    USARTn->TER = UART_TER_TXEN;

    /*
     * Check if we have any bytes to transmit. Send out first byte if there is space in the FIFO
     */
    NutEnterCritical();
    cp = DcbUSART.dcb_tx_rbf.rbf_tail;
    if ((DcbUSART.dcb_tx_rbf.rbf_cnt) && (USARTn->LSR & UART_LSR_THRE)) {
        /*
         * If CTS has been disabled, we disable the transmit interrupts,
         * enable CTS interrupts and return without sending anything.
         */
        // TODO: CTS handling in here

        /* Start transmission of the next character. */
        USARTn->THR = *cp;

        /* Decrement the number of available bytes in the buffer. */
        DcbUSART.dcb_tx_rbf.rbf_cnt--;

        /* Wrap around the buffer pointer if we reached its end. */
        if (++cp == DcbUSART.dcb_tx_rbf.rbf_last) {
            cp = DcbUSART.dcb_tx_rbf.rbf_start;
        }
        DcbUSART.dcb_tx_rbf.rbf_tail = cp;

        /* Send an event if we reached the low watermark. */
        if (DcbUSART.dcb_tx_rbf.rbf_cnt == DcbUSART.dcb_tx_rbf.rbf_lwm) {
            NutExitCritical(); /* Exit critical section _before_ posting to the event queues */
            NutEventPostAsync(&DcbUSART.dcb_tx_rbf.rbf_que);
            NutSelectWakeup(DcbUSART.dcb_tx_rbf.wq_list, WQ_FLAG_WRITE);
        } else {
            NutExitCritical();
        }
    }
}

/*!
 * \brief Start the USART receiver hardware.
 *
 * The upper level USART driver will call this function through the
 * USARTDCB jump table each time it removed enough bytes from the
 * receive buffer. Enough means, that the number of bytes left in
 * the buffer is below the low watermark.
 */
static void Lpc17xxUsartRxStart(void)
{
#if defined(UART_XONXOFF_CONTROL)
    /*
     * Do any required software flow control.
     */
    if (flow_control && (flow_control & XOFF_SENT) != 0) {
        NutUartIrqDisable(&SigUSART);
        /* Check if the transmit holding register is empty */
        if (USARTn->LSR & UART_LSR_THRE) {
            USARTn->THR = ASCII_XON;
            flow_control &= ~XON_PENDING;
        } else {
            flow_control |= XON_PENDING;
        }
        flow_control &= ~(XOFF_SENT | XOFF_PENDING);
        NutUartIrqEnable(&SigUSART);
    }
#endif
    /* Enable receive interrupts. */
    CM3BBSET(USARTnBase, LPC_UART_TypeDef, IER, UART_IER_RBRINT_EN_POS);
}

/*
 * \brief Initialize the USART hardware driver.
 *
 * This function is called during device registration by the upper level
 * USART driver through the USARTDCB jump table.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartInit(void)
{
    volatile uint32_t tmp;

    /*
     * Register receive and transmit interrupts.
     */
    if (NutRegisterIrqHandler(&SigUSART, Lpc17xxUsartInterrupt, &DcbUSART)) {
        return -1;
    }

    /* Enable UART clock and power */
#if defined(MCU_LPC176x)
    if((LPC_UART_TypeDef*)USARTn == LPC_UART0) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART0);
    } else
    if((LPC_UART1_TypeDef*)USARTn == LPC_UART1) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART1);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART2) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART2);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART3) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART3);
    }
#elif defined(MCU_LPC177x_8x) || defined(MCU_LPC407x_8x)
    if((LPC_UART_TypeDef*)USARTn == LPC_UART0) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART0);

        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART0);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART0);
    } else
    if((LPC_UART1_TypeDef*)USARTn == LPC_UART1) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART1);

        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART1);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART1);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART2) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART2);

        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART2);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART2);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART3) {
        SysCtlPeripheralClkEnable(CLKPWR_PCONP_PCUART3);

        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART3);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART3);
    }
#endif
    /* Disable IRQs */
    USARTn->IER = 0;

    /* Clear FIFOs */
    USARTn->FCR = UART_FCR_FIFO_EN | UART_FCR_RX_RS | UART_FCR_TX_RS | UART_FCR_TRG_LEV2;

    /* Dummy reading */
    while (USARTn->LSR & UART_LSR_RDR) {
        tmp = USARTn->RBR;
    }

    /* Enable transmitter */
    USARTn->TER = UART_TER_TXEN;

