l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc17xx_usart.c
    /* Wait for current transmit complete */
    while (!(USARTn->LSR & UART_LSR_THRE));

    /* Disable transmitter */
    USARTn->TER = 0;

    /* Set LCR to default state */
    USARTn->LCR = 0;

    /* Set ACR to default state */
    USARTn->ACR = 0;

#if defined(MCU_LPC176x)
    if((LPC_UART1_TypeDef*)USARTn == LPC_UART1) {
        /* Set RS485 control to default state */
        ((LPC_UART1_TypeDef*)USARTn)->RS485CTRL = 0;

        /* Set RS485 delay timer to default state */
        ((LPC_UART1_TypeDef*)USARTn)->RS485DLY = 0;

        /* Set RS485 addr match to default state */
        ((LPC_UART1_TypeDef*)USARTn)->ADRMATCH = 0;
    }
#elif defined(MCU_LPC177x_8x) || defined(MCU_LPC407x_8x)
    /* Set RS485 control to default state */
    USARTn->RS485CTRL = 0;

    /* Set RS485 delay timer to default state */
    USARTn->RS485DLY = 0;

    /* Set RS485 addr match to default state */
    USARTn->ADRMATCH = 0;
#endif

    /* Dummy reading to clear bits */
    tmp = USARTn->LSR;

    if(((LPC_UART1_TypeDef *)USARTn) == LPC_UART1) {
        /* Set Modem Control to default state */
        ((LPC_UART1_TypeDef *)USARTn)->MCR = 0;

        /* Dummy Reading to Clear Status */
        tmp = ((LPC_UART1_TypeDef *)USARTn)->MSR;
    }
#if defined(MCU_LPC177x_8x) || defined(MCU_LPC407x_8x)
    if(((LPC_UART4_TypeDef *)USARTn) == LPC_UART4) {
        /* Set IrDA to default state for all UART other than UART1 */
        ((LPC_UART4_TypeDef *)USARTn)->ICR = 0;
    }
#endif
    /* Configure USART Tx as alternate function push-pull */
    GpioPinConfigSet( TX_GPIO_PORT, TX_GPIO_PIN, TX_GPIO_PIN_CFG);
    /* Configure USART Rx as input floating */
    GpioPinConfigSet( RX_GPIO_PORT, RX_GPIO_PIN, RX_GPIO_PIN_CFG);

#if defined(RTS_GPIO_PORT) && defined(RTS_GPIO_PIN)
    /* Configure USART RTS as alternate function push-pull */
    GpioPinConfigSet( RTS_GPIO_PORT, RTS_GPIO_PIN, RTS_GPIO_PIN_CFG);
#endif
#if defined(CTS_GPIO_PORT) && defined(CTS_GPIO_PIN)
    /* Configure USART CTS as input floating */
    GpioPinConfigSet( CTS_GPIO_PORT, CTS_GPIO_PIN, CTS_GPIO_PIN_CFG);
#endif


    /* Configure UART communication parameters */

    Lpc17xxUsartSetSpeed(USART_INIT_BAUTRATE);
    Lpc17xxUsartSetDataBits(8);
    Lpc17xxUsartSetStopBits(1);
    Lpc17xxUsartSetParity(0);

    /* Enable additional features */
#ifdef USART_HWFLOWCTRL

    // TODO: Implement GPIO based hardware handshake for UARTS without full modem handshake */
    if ((LPC_UART1_TypeDef *) USARTn == LPC_UART1) {
        /* Enable hardware handshake options */
        tmp = 0;

#if defined(RTS_GPIO_PORT) && defined(RTS_GPIO_PIN)
        tmp |= UART1_MCR_AUTO_RTS_EN;
#endif
#if defined(CTS_GPIO_PORT) && defined(CTS_GPIO_PIN)
        tmp |= UART1_MCR_AUTO_CTS_EN;
#endif
        ((LPC_UART1_TypeDef *)USARTn)->MCR = tmp;
    }
#endif

#ifdef USART_MODE_IRDA
    // TODO: Further IRDA feature configuration
    if(((LPC_UART4_TypeDef *)USARTn) == LPC_UART4) {
        /* Set IrDA to default state for all UART other than UART1 */
        USARTn->ICR = UART_ICR_IRDAEN;
    }
#endif

    NutIrqEnable(&SigUSART);
    return 0;
}

/*
 * \brief Deinitialize the USART hardware driver.
 *
 * This function is called during device deregistration by the upper
 * level USART driver through the USARTDCB jump table.
 *
 * \return 0 on success, -1 otherwise.
 */
static int Lpc17xxUsartDeinit(void)
{
    /* Disable IRQs */
    USARTn->IER = 0;

    /* Disable interrupts */
    NutIrqDisable(&SigUSART);

    /* Deregister receive and transmit interrupts. */
    NutRegisterIrqHandler(&SigUSART, 0, 0);

    /* Disable UART clock and power */

#if defined(MCU_LPC176x)
    if((LPC_UART_TypeDef*)USARTn == LPC_UART0) {
        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART0);
    } else
    if((LPC_UART1_TypeDef*)USARTn == LPC_UART1) {
        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART1);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART2) {
        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART2);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART3) {
        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART3);
    }
#elif defined(MCU_LPC177x_8x) || defined(MCU_LPC407x_8x)
    if((LPC_UART_TypeDef*)USARTn == LPC_UART0) {
        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART0);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART0);

        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART0);
    } else
    if((LPC_UART1_TypeDef *)USARTn == LPC_UART1) {
        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART1);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART1);

        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART1);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART2) {
        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART2);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART2);

        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART2);
    } else
    if((LPC_UART_TypeDef*)USARTn == LPC_UART3) {
        SysCtlPeripheralResetEnable(CLKPWR_RSTCON0_UART3);
        SysCtlPeripheralResetDisable(CLKPWR_RSTCON0_UART3);

        SysCtlPeripheralClkDisable(CLKPWR_PCONP_PCUART3);
    }
#endif

    return 0;
}

/*@}*/
